Ran Plan for 2 projects:

1. project: `cvm` dir: `cvm` workspace: `default`
1. project: `clb` dir: `clb` workspace: `default`
---

### 1. project: `cvm` dir: `cvm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa234fb442bf984095e23ee1bcffc82efc_NpVH8YZIP6wD8AQyEr21UCMaX6qrqUi14T_WHBEPOIjjwaUfKP9b50M8UZHHoUeFsroucaGXYYUcX9N7JZ1wy4vNr5ikDpKympJqYvaPp-Vl73IjBAxJIVAqpe1fYqTg4xRyCt369u83KXl0aRlxbC0ODYvpfflCzIg_d2KDJ2C3UB51CrqPPGKog5P0FkxSXxjcH-PP5asssfpCfrAcmU80n2JsyxhHdUcDkMh6SuVBOnjZOu7JQWBhEi97tTnTw3KPfaEqbk7r2MewI7FfnYRf2-gR58DLACGB9tyUvM-YptMF1gI9FGATHWWsKyGjDVYeURbf5S6tSRVgmiU66Ci3jVPIrbUDBeZebVipDTy55KHMK-uERG4gC-QPit9QmV7kGs78cGanL97-21uoMgK1XGd78FvWNgDjAK1_U8
TmpSecretId=AKID0pc0vdf70sC0ICVJ5JNUR_SAbrtAw-A6wL5SvGqZhSSxRSPGjecz1ZSEDAu4zX8O
TmpSecretKey=E68/TpAp5R+Pewnd2NETSyVOs8vFHTfk8/OIQuQiD4M=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKID0pc0vdf70sC0ICVJ5JNUR_SAbrtAw-A6wL5SvGqZhSSxRSPGjecz1ZSEDAu4zX8O
TENCENTCLOUD_SECRET_KEY=E68/TpAp5R+Pewnd2NETSyVOs8vFHTfk8/OIQuQiD4M=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa234fb442bf984095e23ee1bcffc82efc_NpVH8YZIP6wD8AQyEr21UCMaX6qrqUi14T_WHBEPOIjjwaUfKP9b50M8UZHHoUeFsroucaGXYYUcX9N7JZ1wy4vNr5ikDpKympJqYvaPp-Vl73IjBAxJIVAqpe1fYqTg4xRyCt369u83KXl0aRlxbC0ODYvpfflCzIg_d2KDJ2C3UB51CrqPPGKog5P0FkxSXxjcH-PP5asssfpCfrAcmU80n2JsyxhHdUcDkMh6SuVBOnjZOu7JQWBhEi97tTnTw3KPfaEqbk7r2MewI7FfnYRf2-gR58DLACGB9tyUvM-YptMF1gI9FGATHWWsKyGjDVYeURbf5S6tSRVgmiU66Ci3jVPIrbUDBeZebVipDTy55KHMK-uERG4gC-QPit9QmV7kGs78cGanL97-21uoMgK1XGd78FvWNgDjAK1_U8
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa6e357d25b1b5c31254d086aae0fd2791_NpVH8YZIP6wD8AQyEr21Sr70EfU80rDYFaZZclJkIS5hI27QGRnU1yUm7edoVztEqFKjKBBLyrwWqPWm1stYzI0_i-vzd6lD6_oKBOkaPyPC4RiiFhFMD-yNW8nNvKdcHiXSl9M1lU0q9Ir5b6XXWDdpmVGUMMDPlsBLP1Bi_LH3Bi9L-RKWKBhNimMRxZmT2Jbciz_5v2UPXKlaQIZpowCclF8dTBvc5E7ZZcsC4t1khv9C9SRVGCBCwr6X9jtgSQQN0KH-JbRzFvZyK5-NhR5O_ToGHL8058mx-9Y04cn6QvvKJx2Yd17bHEPTFpwGLODmqhRAAPqMb-NByJgmtIWJSWTMwEVpLV7gn739-m1_B_RJvqNnakt6oH3FB_JrABYxVa-zkZkNErwyHevVPh6M9ACJdyKuwC8drmpjrE
TmpSecretId=AKIDkkW4MdN_iBOQif2Dny7RB82hK-M_-V726DJkb2jXXyw4MS89VXEJx5Rjz1t3op1e
TmpSecretKey=iqfGfzq8CfRlpndfMBEISkDcEUOIBk8KWgObL2mAiWo=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDkkW4MdN_iBOQif2Dny7RB82hK-M_-V726DJkb2jXXyw4MS89VXEJx5Rjz1t3op1e
TENCENTCLOUD_SECRET_KEY=iqfGfzq8CfRlpndfMBEISkDcEUOIBk8KWgObL2mAiWo=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa6e357d25b1b5c31254d086aae0fd2791_NpVH8YZIP6wD8AQyEr21Sr70EfU80rDYFaZZclJkIS5hI27QGRnU1yUm7edoVztEqFKjKBBLyrwWqPWm1stYzI0_i-vzd6lD6_oKBOkaPyPC4RiiFhFMD-yNW8nNvKdcHiXSl9M1lU0q9Ir5b6XXWDdpmVGUMMDPlsBLP1Bi_LH3Bi9L-RKWKBhNimMRxZmT2Jbciz_5v2UPXKlaQIZpowCclF8dTBvc5E7ZZcsC4t1khv9C9SRVGCBCwr6X9jtgSQQN0KH-JbRzFvZyK5-NhR5O_ToGHL8058mx-9Y04cn6QvvKJx2Yd17bHEPTFpwGLODmqhRAAPqMb-NByJgmtIWJSWTMwEVpLV7gn739-m1_B_RJvqNnakt6oH3FB_JrABYxVa-zkZkNErwyHevVPh6M9ACJdyKuwC8drmpjrE

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.cvm_cicd_kk_1 will be created
  + resource "tencentcloud_instance" "cvm_cicd_kk_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + hostname                                = "user"
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cvm_cicd_kk_1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = 50
          + data_disk_type         = "CLOUD_PREMIUM"
          + delete_with_instance   = true
          + encrypt                = false
          + throughput_performance = 0
        }
    }

  # tencentcloud_subnet.cicd_kk will be created
  + resource "tencentcloud_subnet" "cicd_kk" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.1.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd_kk_subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_kk will be created
  + resource "tencentcloud_vpc" "cicd_kk" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd_kk_vpc"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)
  + public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cvm
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fcvm%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cvm
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `clb` dir: `clb` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa94e1203a1575c82e68342b876aae27cb_NpVH8YZIP6wD8AQyEr21XfSbdLqVeo2MKmGvBZ1UcWU6LSPJqjKvHxN2J8e9cDbUIGFQm8fFeCrJB0LQID9KYSObLIP-wp7kppURMmjFGa8hRqpth3O5VaghKEMQOPE-F5WfX4IlEpcgx79kdgf_SqzMU6TTTHkIXevDlIpTf14VBeAY1lJbjgEbfAVbjuO4bfx0xTUQjrdZeXeeWBm5mcFyxUZ-6CFM77-tlRKOuftpmGcoE6mKHXMhVBe-zy8q5i1w0l_By8_lOYgLuBViyB7V3grs11yuENrzbT4Hz5rAPbfi9ZUcekJs8wKxStvtgrFZYuLwk8Wg3ED-IVsWsE-Al5wN2xc3jANcIVe0kDbQNl4vjLKizg7XuRGBFWBAEU1-aHZN8duj-cDAXmcYVKyEdOUDmhGQJqjT8bG-00
TmpSecretId=AKIDNWvVkUCviuPYMqySF2WwOoZYp6Xnvx01wZOWnlGlGYp_yr2W9KzMgIzaKQIqIlAO
TmpSecretKey=KCjtJbPYcw640bm7hsBYtUVpI7nHIFW0HCBkQ044504=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDNWvVkUCviuPYMqySF2WwOoZYp6Xnvx01wZOWnlGlGYp_yr2W9KzMgIzaKQIqIlAO
TENCENTCLOUD_SECRET_KEY=KCjtJbPYcw640bm7hsBYtUVpI7nHIFW0HCBkQ044504=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOa94e1203a1575c82e68342b876aae27cb_NpVH8YZIP6wD8AQyEr21XfSbdLqVeo2MKmGvBZ1UcWU6LSPJqjKvHxN2J8e9cDbUIGFQm8fFeCrJB0LQID9KYSObLIP-wp7kppURMmjFGa8hRqpth3O5VaghKEMQOPE-F5WfX4IlEpcgx79kdgf_SqzMU6TTTHkIXevDlIpTf14VBeAY1lJbjgEbfAVbjuO4bfx0xTUQjrdZeXeeWBm5mcFyxUZ-6CFM77-tlRKOuftpmGcoE6mKHXMhVBe-zy8q5i1w0l_By8_lOYgLuBViyB7V3grs11yuENrzbT4Hz5rAPbfi9ZUcekJs8wKxStvtgrFZYuLwk8Wg3ED-IVsWsE-Al5wN2xc3jANcIVe0kDbQNl4vjLKizg7XuRGBFWBAEU1-aHZN8duj-cDAXmcYVKyEdOUDmhGQJqjT8bG-00
Initializing the backend...
Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.111...
- Installed tencentcloudstack/tencentcloud v1.81.111 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Token=WmscDR409iAXGy8Hex7HdRAIh9O2rbOae642ab7e874777cc040b2310ab5cdb06_NpVH8YZIP6wD8AQyEr21RrmwvBqV5mgPdLrDGQsgRbPrG06JRwMzMUI9u7NsaBUPumd7Ruhmn9-xjuM_shY380ecUFsSd2yvgWnmdMk0HW9zvuayp5v6KUZEq9FP7mHaYaKz0yyXj7OY9EdPtOE1KeaqvXHEBX6d_mPS4OI4R9GKVKi-Vj3gRfex7esF4ndIUVFV90jh7dVgjMVH8Q0MKuyHphqho9P90jIO51yEjP7PL8ghhVziq_tVSSoWycg5xnEsjagRLaR3bpBg-972gcSF_OJgYtE0rkODOi9uJic1iQeDFbe_yR_4104LrsuudIMcTGsstZQZmsXFdtyenU_xtSGs4HJCSTNormdoTq2vY7epb85dFKj_BK1wCsjrjq0nUeItK2OoKLrbjUelhc2FB1njKGT2dhtrTRxX-A
TmpSecretId=AKIDW4kv__afWuQtTmD1GxLF3_dCy_3UP_aogaaew_EAhIcoKOF4PoE6R1EbEA5pH4J3
TmpSecretKey=f2huNmxSTYllIQQpn+e9pCYXQEJfxIyp2LihKy3Qzys=
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDW4kv__afWuQtTmD1GxLF3_dCy_3UP_aogaaew_EAhIcoKOF4PoE6R1EbEA5pH4J3
TENCENTCLOUD_SECRET_KEY=f2huNmxSTYllIQQpn+e9pCYXQEJfxIyp2LihKy3Qzys=
TENCENTCLOUD_SECURITY_TOKEN=WmscDR409iAXGy8Hex7HdRAIh9O2rbOae642ab7e874777cc040b2310ab5cdb06_NpVH8YZIP6wD8AQyEr21RrmwvBqV5mgPdLrDGQsgRbPrG06JRwMzMUI9u7NsaBUPumd7Ruhmn9-xjuM_shY380ecUFsSd2yvgWnmdMk0HW9zvuayp5v6KUZEq9FP7mHaYaKz0yyXj7OY9EdPtOE1KeaqvXHEBX6d_mPS4OI4R9GKVKi-Vj3gRfex7esF4ndIUVFV90jh7dVgjMVH8Q0MKuyHphqho9P90jIO51yEjP7PL8ghhVziq_tVSSoWycg5xnEsjagRLaR3bpBg-972gcSF_OJgYtE0rkODOi9uJic1iQeDFbe_yR_4104LrsuudIMcTGsstZQZmsXFdtyenU_xtSGs4HJCSTNormdoTq2vY7epb85dFKj_BK1wCsjrjq0nUeItK2OoKLrbjUelhc2FB1njKGT2dhtrTRxX-A

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_clb_attachment.attachment_tcp will be created
  + resource "tencentcloud_clb_attachment" "attachment_tcp" {
      + clb_id        = (known after apply)
      + id            = (known after apply)
      + listener_id   = (known after apply)
      + protocol_type = (known after apply)

      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
    }

  # tencentcloud_clb_instance.cicd_foo will be created
  + resource "tencentcloud_clb_instance" "cicd_foo" {
      + address_ip_version           = (known after apply)
      + address_ipv6                 = (known after apply)
      + clb_name                     = "cicd_foo_clb"
      + clb_vips                     = (known after apply)
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + internet_bandwidth_max_out   = (known after apply)
      + internet_charge_type         = (known after apply)
      + ipv6_mode                    = (known after apply)
      + load_balancer_pass_to_target = false
      + master_zone_id               = (known after apply)
      + network_type                 = "OPEN"
      + project_id                   = 0
      + security_groups              = (known after apply)
      + sla_type                     = (known after apply)
      + slave_zone_id                = (known after apply)
      + target_region_info_region    = (known after apply)
      + target_region_info_vpc_id    = (known after apply)
      + vip                          = (known after apply)
      + vip_isp                      = (known after apply)
      + vpc_id                       = (known after apply)
      + zone_id                      = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_dst will be created
  + resource "tencentcloud_clb_listener" "listener_http_dst" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_dst"
      + port                       = 81
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_src will be created
  + resource "tencentcloud_clb_listener" "listener_http_src" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_src"
      + port                       = 80
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_tcp will be created
  + resource "tencentcloud_clb_listener" "listener_tcp" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = 2
      + health_check_http_code     = 2
      + health_check_http_method   = "GET"
      + health_check_http_version  = "HTTP/1.0"
      + health_check_interval_time = 100
      + health_check_port          = 200
      + health_check_switch        = true
      + health_check_time_out      = 30
      + health_check_type          = "HTTP"
      + health_check_unhealth_num  = 2
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_tcp"
      + port                       = 8080
      + protocol                   = "TCP"
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener_rule.rule_http_dst will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_dst" {
      + clb_id                     = (known after apply)
      + domain                     = "abcd.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_listener_rule.rule_http_src will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_src" {
      + clb_id                     = (known after apply)
      + domain                     = "abc.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_redirection.redirection_http will be created
  + resource "tencentcloud_clb_redirection" "redirection_http" {
      + clb_id                  = (known after apply)
      + delete_all_auto_rewrite = false
      + id                      = (known after apply)
      + source_listener_id      = (known after apply)
      + source_rule_id          = (known after apply)
      + target_listener_id      = (known after apply)
      + target_rule_id          = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_1 will be created
  + resource "tencentcloud_instance" "cicd_foo_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_instance.cicd_foo_2 will be created
  + resource "tencentcloud_instance" "cicd_foo_2" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm2"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks (known after apply)
    }

  # tencentcloud_security_group.cicd_foo will be created
  + resource "tencentcloud_security_group" "cicd_foo" {
      + id         = (known after apply)
      + name       = "cicd-foo-sg"
      + project_id = (known after apply)
    }

  # tencentcloud_subnet.cicd_foo will be created
  + resource "tencentcloud_subnet" "cicd_foo" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/16"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd-foo-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_foo will be created
  + resource "tencentcloud_vpc" "cicd_foo" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd-foo-vpc"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clb_instance_id  = (known after apply)
  + cvm1_instance_id = (known after apply)
  + cvm2_instance_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p clb
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://43.133.145.82:4141/events/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fclb%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p clb
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```